In [22]:
import pandas as pd

In [23]:
df = pd.read_csv('C:/Users/Ramsha Ahmed/Documents/employees1.csv')

In [24]:
df.head()

   Emp_ID     Name Department   Salary   Age
0   101.0    Alice         HR  50000.0  25.0
1   102.0      Bob    Finance      NaN  30.0
2   103.0  Charlie        NaN  55000.0   NaN
3   104.0    David         IT  60000.0  28.0
4   105.0    Alice         HR  50000.0  25.0

In [25]:
df.tail(2
       
       )

   Emp_ID   Name Department   Salary   Age
4   105.0  Alice         HR  50000.0  25.0
5     NaN   Emma    Finance  58000.0  29.0

In [26]:
df.isnull()

   Emp_ID   Name  Department  Salary    Age
0   False  False       False   False  False
1   False  False       False    True  False
2   False  False        True   False   True
3   False  False       False   False  False
4   False  False       False   False  False
5    True  False       False   False  False

In [27]:
df.notnull()

   Emp_ID  Name  Department  Salary    Age
0    True  True        True    True   True
1    True  True        True   False   True
2    True  True       False    True  False
3    True  True        True    True   True
4    True  True        True    True   True
5   False  True        True    True   True

In [28]:
df = df.dropna(subset=["Emp_ID"])
df = df.dropna(subset=["Salary"])

In [29]:
df['Department'] = df['Department'].fillna('Unknown')
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [35]:
print(df)

   Emp_ID     Name Department   Salary   Age
0   101.0    Alice         HR  50000.0  25.0
2   103.0  Charlie    Unknown  55000.0  26.0
3   104.0    David         IT  60000.0  28.0
4   105.0    Alice         HR  50000.0  25.0

In [36]:
df = df.rename({'Emp_ID':'Employee_ID'})

In [37]:
print(df)

   Emp_ID     Name Department   Salary   Age
0   101.0    Alice         HR  50000.0  25.0
2   103.0  Charlie    Unknown  55000.0  26.0
3   104.0    David         IT  60000.0  28.0
4   105.0    Alice         HR  50000.0  25.0